In [1]:
import pandas as pd
print("the version of pandas is", pd.__version__)

people = {"first": ["Corey", "Jane", "John"],
          "last": ["Schafer", "Doe", "Doe"],
          "email": ["CoreySchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
          }
df = pd.DataFrame(people)
df

the version of pandas is 2.2.2

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@email.com
2   John      Doe       JohnDoe@email.com

In [2]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [3]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                   email      full_name
0  Corey  Schafer  CoreySchafer@gmail.com  Corey Schafer
1   Jane      Doe       JaneDoe@email.com       Jane Doe
2   John      Doe       JohnDoe@email.com       John Doe

In [4]:
df.drop(columns=['first', 'last'], inplace=True)
df

                    email      full_name
0  CoreySchafer@gmail.com  Corey Schafer
1       JaneDoe@email.com       Jane Doe
2       JohnDoe@email.com       John Doe

In [5]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [6]:
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True)
df

                    email      full_name first_name last_name
0  CoreySchafer@gmail.com  Corey Schafer      Corey   Schafer
1       JaneDoe@email.com       Jane Doe       Jane       Doe
2       JohnDoe@email.com       John Doe       John       Doe

In [7]:
df._append({'first_name': 'Tony'}, ignore_index=True)

                    email      full_name first_name last_name
0  CoreySchafer@gmail.com  Corey Schafer      Corey   Schafer
1       JaneDoe@email.com       Jane Doe       Jane       Doe
2       JohnDoe@email.com       John Doe       John       Doe
3                     NaN            NaN       Tony       NaN

In [8]:
people_ = {'first': ['Tony', 'Steve'],
           'last': ['Stark', 'Rogers'],
           'email': ['IronMan@avenge.com', 'Cap@avenge.com']}
df_ = pd.DataFrame(people_)
df_

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [9]:
df_.rename(columns={'first': 'first_name', 'last': 'last_name'}, inplace=True)
df_

  first_name last_name               email
0       Tony     Stark  IronMan@avenge.com
1      Steve    Rogers      Cap@avenge.com

In [10]:
df = df._append(df_, ignore_index=True)
df

                    email      full_name first_name last_name
0  CoreySchafer@gmail.com  Corey Schafer      Corey   Schafer
1       JaneDoe@email.com       Jane Doe       Jane       Doe
2       JohnDoe@email.com       John Doe       John       Doe
3      IronMan@avenge.com            NaN       Tony     Stark
4          Cap@avenge.com            NaN      Steve    Rogers

In [11]:
df['full_name'] = df['first_name'] + ' ' + df['last_name']
df

                    email      full_name first_name last_name
0  CoreySchafer@gmail.com  Corey Schafer      Corey   Schafer
1       JaneDoe@email.com       Jane Doe       Jane       Doe
2       JohnDoe@email.com       John Doe       John       Doe
3      IronMan@avenge.com     Tony Stark       Tony     Stark
4          Cap@avenge.com   Steve Rogers      Steve    Rogers

In [12]:
df.drop(index=4)

                    email      full_name first_name last_name
0  CoreySchafer@gmail.com  Corey Schafer      Corey   Schafer
1       JaneDoe@email.com       Jane Doe       Jane       Doe
2       JohnDoe@email.com       John Doe       John       Doe
3      IronMan@avenge.com     Tony Stark       Tony     Stark

In [13]:
filt = (df['last_name'] == 'Doe')
df.drop(index=df[filt].index)

                    email      full_name first_name last_name
0  CoreySchafer@gmail.com  Corey Schafer      Corey   Schafer
3      IronMan@avenge.com     Tony Stark       Tony     Stark
4          Cap@avenge.com   Steve Rogers      Steve    Rogers